export default {
    WARNING_DUPLICATE: 'В магазине найден дубликат ключа от товара:',
    INVALID_STORE: 'Попытка разобрать несуществующий магазин.',
    INVALID_STORE_REFRESH: 'Попытался обновить недействительный магазин:',
    INVALID_ITEM_SELECTION: 'Неверный выбор элемента.',
    PURCHASE_INVALID_STORE: 'пытались приобрести товар, которого нет в магазине:',
    SELL_INVALID_ITEM: 'пытался продать недействительный товар.',
    ITEM_OUT_OF_STOCK: 'В настоящее время этот товар отсутствует на складе.',
    NOT_ENOUGH_CURRENCY: 'У вас недостаточно валюты для покупки этого предмета.',
    NOT_ENOUGH_SPACE: 'У вас недостаточно места в инвентаре.',
    CANNOT_SELL_ITEM: 'Вы не можете продать этот предмет.',
    ACTION_STORE_NOT_OPEN: 'Попытка выполнить действие для магазина, который не открыт.',
    CHEATER: 'Вы были отмечены за мошенничество. Вы не можете ничего приобрести.',
    RESTRICTED_STORE: 'Этот магазин не принимает никаких товаров.',
    INVALID_ITEM_COUNT: 'Вы ввели недопустимое количество товаров.'
};
